Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>giMGNXAwFPXST1QVMaIdulL70r4+xWTZS7SckwwUN62RhdXtkFgMFisfvqONioCgeEpr5i3klaX5&#13;
pvJCC/3zJQQJVfH/Y5tx5kOWQJTiMedb9Tot+F9s/MbCaaQRNaAiiKXibbsqb1tlN2s2kAIerEIw&#13;
bON/3b7dqOBDiMIBkGk=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>EjgrEBkoOEQzxGmjLl8ZYDxOiFtaLsndurzP9Oa3ueZ48Wdx8tJPwp8vbuJ/R7FzLM9SeUgepgwp&#13;
nkq2kAVWRqQL6DIPRRfWcQUT6dgi0DCQxDg08J05zN20a7xqUJIGmj8kOx+sftaF30pbnHuNUzq/&#13;
o3Vlz2ACxC71BJVTjOhrvXbZXGiM/zG6BFmeaYS83BVRkW3nN2+amSDZi8hOePM+WCw6x796D5KJ&#13;
oeLKe9LVx/dvP+CeIoy7q25D11SJ3wSPqxhaXAGW03H3H89KCF+C5PaVXTDMfMjEm/ZTunEDEmLj&#13;
53nrxgTrzbcaeMk4Hzy9CWcxnfGbGnHr+XbvZiZXnuMIgS4UcvxBtzqaaDaysmwnbuCHM81K7UF4&#13;
VgU7oe15RF69zfegPeDZoTyvmiUr6Yol8yS1UKLNO0yYJifevVGjMxgPog2MAREbWDqffR6w1QVL&#13;
2hMwCIaWkAKT5aDR3x3Eco7gKfBppTV8wV/BcmigPaTe+RN8NkVdcokfzei9AUuA7wzaXiSgaNkO&#13;
pWDFPKt2odbNBRg01NYjZoZJ3qUjUeJBNm6sDcFfmA8S1lqJFK1QdLsmnQm/pPF/l3tAGYsku37E&#13;
F/5ZeJOqMwE5eF3GvSza/UaH2ihipa85rwrg6VrZ2MlR7U66dZC89rk5CgWSU3NnbXr/c5h4jHEB&#13;
GZjV0/I8K0iR1mIzgtu3W23wjXaOXl0BWMVfsBvMK8amamIRF49LBqO2RPd0FNLEk6LdxYxodSbu&#13;
3SIJLJkz0XHQOmf9r9afGZW6zWjOEBxJmZVjaWoGTaytEFHc7INst9lXUefQuKfMqNKXO14m9ypv&#13;
4YTrNkUErXkOT1jpeZ+ZzmcaulXMoy/A5cEdrQY/TbCw5SSSfxT9ga4AMLILIHHZX4mwgwnw4S3+&#13;
/Vb8f0HINoT0y5riV9VSyPH3gmuhHdN1BBV33aR3v/u/q7ea</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>dZafpXlOFa+LeH7CUEDZH8jNt6I=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
HINwax2Md5lQQTDDyxzPdf8rAZxLtysZltu1vuC/HWuaL+gKPOPewbp0RlyInGI17x5CqPrM5dNK&#13;
2yuIfqUQgkXQRTG2tjLKPv+0mX31+n2UrUNYZ9Np30w/0SAAgMSWaBzXkIYBNSn2obI6VKE3/Fpl&#13;
bmbfcHq+dowkiKfYvEk=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>